

import 'package:apis_app/users_model.dart';
import 'package:dio/dio.dart';
import 'package:retrofit/retrofit.dart';

 //دا لازم اكتبه برضو عشان يجنريت وبيبقى بنفس اسم الفايل
part 'web_services.g.dart';

//اخدت التلات سطور دول من باكيدج ريترةفيت وبغير البيز يو ار ال واسم الكلاس
 @RestApi(baseUrl: 'https://gorest.co.in/public/v2/')

abstract class WebServices {

 factory WebServices(Dio dio, {String? baseUrl}) = _WebServices;

  @GET('users')   //وهنا بكتب الباث اللي هو الايندبوينت اللي قلنا بعد البيز يو ار ال
 //هعمل ليست اوفريوزرز لانها ليست ف البوست مان وشايل اوبجيكتس اسمها يوزرز
 //ولو كان راجع اوبجيكت واحد مش ليستا بكتب اسمها يوزرز بس
 Future<List<UsersModel>> getAllUsers () ;

  //ده الباث اللي هو بيبقى بين تو اسلاشز او بعد اسلاش رقم ثابت من غير علامة استفهام بتاع الكواري
 //هنا حطيت الاي دي عشان يقبل اي رقم مش يوزر معين
 @GET('users/{id}')
//هنا هكتب يوزرز موديل يعني الاسم من غير ليست لانه اوبجيكت واحد بس
 //الفانكشن دي هتاخد الباث اللي هو الاي دي اللي محتاجه وهنا تيجي قوة الريتروفيت الباكيدج
 //بتدي انوتيشن اسمه باث الاندبوينت بتفهم من خلاله اني بدي اي دي
 Future<UsersModel> getUserById ( @Path('id') int userId ) ;
//بتكتب جوه قوسين الباث اللي هو مستنيه لكن بعد كلمة انت بتكتب بتاع لغتك انتا
//نتعود نكتب زي ما الدكيومنتيشن قايلالنا وده من الريتروفيت
 }
 //لازم بعد اي تغيير ولو بسيط ف ده اعمل dart run build_runner build
//كده الويب سيرفزز ده هيجيب الداتا يباصيها للريبوزتري الريبو والريبو يديها للكيوبت والكيوبت يديها لليو اي
