

import 'package:apis_app/users_model.dart';
import 'package:dio/dio.dart';
import 'package:retrofit/retrofit.dart';

 //دا لازم اكتبه برضو عشان يجنريت وبيبقى بنفس اسم الفايل
part 'web_services.g.dart';

//اخدت التلات سطور دول من باكيدج ريترةفيت وبغير البيز يو ار ال واسم الكلاس
 @RestApi(baseUrl: 'https://gorest.co.in/public/v2/')

abstract class WebServices {

 factory WebServices(Dio dio, {String? baseUrl}) = _WebServices;

  @GET('users')   //وهنا بكتب الباث اللي هو الايندبوينت اللي قلنا بعد البيز يو ار ال
 //هعمل ليست اوفريوزرز لانها ليست ف البوست مان وشايل اوبجيكتس اسمها يوزرز
 //ولو كان راجع اوبجيكت واحد مش ليستا بكتب اسمها يوزرز بس
 Future<List<UsersModel>> getAllUsers () ;

  //ده الباث اللي هو بيبقى بين تو اسلاشز او بعد اسلاش رقم ثابت من غير علامة استفهام بتاع الكواري
 //هنا حطيت الاي دي عشان يقبل اي رقم مش يوزر معين
 @GET('users/{id}')
//هنا هكتب يوزرز موديل يعني الاسم من غير ليست لانه اوبجيكت واحد بس
 //الفانكشن دي هتاخد الباث اللي هو الاي دي اللي محتاجه وهنا تيجي قوة الريتروفيت الباكيدج
 //بتدي انوتيشن اسمه باث الاندبوينت بتفهم من خلاله اني بدي اي دي
 Future<UsersModel> getUserById ( @Path('id') int userId ) ;
//بتكتب جوه قوسين الباث اللي هو مستنيه لكن بعد كلمة انت بتكتب بتاع لغتك انتا
//نتعود نكتب زي ما الدكيومنتيشن قايلالنا وده من الريتروفيت

 //لازم بعد اي تغيير ولو بسيط ف ده اعمل dart run build_runner build
//كده الويب سيرفزز ده هيجيب الداتا يباصيها للريبوزتري الريبو والريبو يديها للكيوبت والكيوبت يديها لليو اي


// هنا هنبدء البوست عشان لو عايز اكريت كود والموقع اللي كنت داخل من عليه طالب بيرير توكين عشان اعرف اعمل ع بوست مان
//بدخل ع الاوزينتكيشن ف البوست مان عند البودي وبختار نوع الاوث وبيزيك يعني ايميل وباسورد والبيريل توكين بدخل ع مثلا لينك جو ريست وبعمل لوجين واطلب التوكين
//ببدء ادخل بعد كده التوكين واعدل ع الاوبجيكت فوق اكريت ايميل جديد من البدي واخليه روو لكن لو جيت مكنتش هعمل حاجه كان هيبقى نن
 //الاند بوينت دي اسمها كرييت نيو يوزر بترجعلي اوبجيكت من اليوزرز موديل ولازم تاخد ف البدي بتاعها ف الريكويست نيو يوزر
 //وف الهيدر الاوزرايزشن بياخد توكين اللي بجيبه لما بعمل لوجين
  @POST('users')
  Future<UsersModel> createNewUser(
      @Body() UsersModel newUser,
      @Header('Authorization') String token,
      );

  //وهاخد بالي من اللينك بتاع الجو ريست هلاقسي عند الديليت في الاي دي بتاع اليوزر
 //وتجربه ع بوست مان الاي دي والبدي هيبقى نن لاني بديليت بس والاوث بالبريل توكين زي ماقالوا ف الموقع
 //ولما هعمل ف البوست مان هيطلع 204 نو كونتينت وده معناه انه عمل ديليت والركويست نجح
  @DELETE('users/{id}')
  //وهنا بقول الفيوتشر مش بترجع حاجه ممكن اكتبها ديناميك بس فيه ف ريتروفيت حاجه اسمها
  //اتش تيتي بي ريسبونس لو عايز ترجع حرفيا اللي رجلك من الريسبونس الداتا بيز
  //
  Future<HttpResponse> deleteUser(
//ولازم طبعا ابعتله الباث اللي هو الاي دي بتاع اليوزر اللي هدلته
//والاوث البرير توكين زي ما الموقع طالب مني ف البوست والدليت والبيتش
 //لازم تحطي جوه @Path() اسم الـ key اللي في URL الباث
 //عشان Retrofit يعرف إن ده متغير اسمه id هيحطه مكان {id} في الـ URL.
       @Path('id') String id , @Header('Authorization') String token,
//كان ممكن ف الانجيكشن وانت بتسطب ريتروفيت وديو تباصي او تعمل ادد لهيدر اوتوماتيك
//وتديله التوكين مره واحده ع مستوى كل الاند بوينتس اللي هتكلم فيهم الداتا بيز وتديهم الهيدر
//وسواء كانت عايزه او لا مش هتخسر بدل مايطلبه منك ف كتير وتزود كود

  );

 }
//
